let data = [
  "Засгийн",
  "газарт",
  "6.4",
  "сая",
  "тонн",
  "нүүрс",
  "алдагдсан",
  "гэх",
  "мэдээлэл",
  "ирээгүй",
  "байна.",
  "Бодит",
  "байдалд",
  "ийм",
  "их",
  "хэмжээний",
  "нүүрс",
  "алдагдсан",
  "гэх",
  "асуудал",
  "эргэлзээтэй",
  "байна.",
  "Хууль",
  "хяналтын",
  "байгууллага",
  "хяналт",
  "шалгалтын",
  "ажил",
  "явуулж",
  "байна",
];
let input = "байна";
let num = 0;
let count = 0;
while (num < data.length) {
  if (data[num] == input) {
    count++;
  }
  num++;
}

console.log(count);
